'''
    https://stepik.org/lesson/3368/step/9?unit=951

    Напишите программу, на вход которой подается одна строка с целыми числами. Программа должна вывести сумму этих чисел.
    Используйте метод split строки.
'''

list = [int(i) for i in input().split()]
print(sum(list))
